app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
	def index #posts_path for Gets
		@posts = Post.all

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
---
	def show #post_path          GET  /posts/:id
		@post = Post.find(params[:id])

INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My post title"], ["description", "My post description"], ["created_at", "2015-12-31 19:45:52.559860"], ["updated_at", "2015-12-31 19:45:52.559860"]]
---
	def create #posts_path for POST
	  @post = Post.new
	  @post.title = params[:title]
	  @post.description = params[:description]
	  @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
---
	def edit #edit_post_path       /posts/:id/edit
		@post = Post.find(params[:id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "posts" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "My edit"], ["description", "My post description"], ["updated_at", "2015-12-31 20:39:10.987245"], ["id", 1]]
---
	def update #post_path for PUT    PUT  /posts/:id
		@post = Post.find(params[:id])
		@post.update(title: params[:title], description: params[:description])